"""Временные данные для отображения в UI"""


receipt_set = {
    1: {'data': '03.03.2020', 'name': 'Роснефть', 'sum': '2000'},
    2: {'data': '13.03.2020', 'name': 'Азбука вкуса', 'sum': '2725'},
    3: {'data': '23.03.2020', 'name': 'Лента', 'sum': '5389'},
    4: {'data': '25.03.2020', 'name': 'Рога И Копыта ООО', 'sum': '2390'},
    5: {'data': '26.03.2020', 'name': 'Айлин', 'sum': '189'},
    6: {'data': '27.03.2020', 'name': 'Акадо Телеком', 'sum': '650'},
    7: {'data': '27.03.2020', 'name': 'МТС', 'sum': '200'},
}

receipt_set_detailed = {
    1: {'id': 1, 'name': 'Бензин Аи-92', 'price': 40.0, 'qnt': 50, 'sum': 2000, 'cat': 0},
    2: {'id': 2, 'name': 'Колбаса любительская', 'price': 335, 'qnt': 1, 'sum': 335, 'cat': 0},
    3: {'id': 2, 'name': 'Молоко', 'price': 78, 'qnt': 2, 'sum': 156, 'cat': 0},
    4: {'id': 3, 'name': 0, 'price': 0, 'qnt': 0, 'sum': 0, 'cat': 0},
    5: {'id': 4, 'name': 0, 'price': 0, 'qnt': 0, 'sum': 0, 'cat': 0},
}